TangentSurfIntInfo.m_secondDeriv
In an "eigenframe" (u0, u1) for the 2nd-order approximation of the deviation between the two surfaces,
the deviation is given by ((1/2)*m_secondDeriv[0]*u0^2, (1/2)*m_secondDeriv[0]*u1^2

TangentSurfIntInfo.estimateDeviations(System.Double,System.Double*,System.Double*)
estimateDeviations should only be called if tangentIntersection() == true. Input tangentialDist
is a 3D distance in the surfaces' common tangent plane. Outputs pDeviation0 and pDeviation1 hold
the local maxima of the 3D deviations between the surfaces' 2nd-order approximations at a distance
of tangentialDist from the intersection point (the local maxima occur at the "eigendirections").
The maximum of these two (positive) values estimates how far apart the two surfaces are at a distance
of tangentialDist from the intersection point.

TangentSurfIntInfo.degenerateIntersection
degenerateIntersection returns true if the surfaces agree to second order at the intersection point, false if not.

TangentSurfIntInfo.tangentIntersection
tangentIntersection returns true if the surfaces are tangent at the intersection point, false if not.

TangentSurfIntInfo.set(System.Boolean,System.Double*)
All arguments to "set" must be provided.

TangentSurfIntInfo
This class stores some optional output for findSurfIntDirs.